sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_ll_rcc.c
    /* PCLK1 clock frequency */
    RCC_Clocks->PCLK1_Frequency  = RCC_GetPCLK1ClockFreq(RCC_Clocks->HCLK_Frequency);
}

/**
  * @brief  Return USARTx clock frequency
  * @param  USARTxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_USART1_CLKSOURCE
  *         @arg @ref LL_RCC_USART2_CLKSOURCE
  * @retval USART clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator (HSI or LSE) is not ready
  */
uint32_t LL_RCC_GetUSARTClockFreq(uint32_t USARTxSource)
{
    uint32_t usart_frequency = LL_RCC_PERIPH_FREQUENCY_NO;

    /* Check parameter */
    assert_param(IS_LL_RCC_USART_CLKSOURCE(USARTxSource));

    if (USARTxSource == LL_RCC_USART1_CLKSOURCE)
    {
        /* USART1CLK clock frequency */
        switch (LL_RCC_GetUSARTClockSource(USARTxSource))
        {
        case LL_RCC_USART1_CLKSOURCE_SYSCLK: /* USART1 Clock is System Clock */
            usart_frequency = RCC_GetSystemClockFreq();
            break;

        case LL_RCC_USART1_CLKSOURCE_HSI:    /* USART1 Clock is HSI Osc. */
            if (LL_RCC_HSI_IsReady() == 1U)
            {
                usart_frequency = HSI_VALUE;
            }
            break;

        case LL_RCC_USART1_CLKSOURCE_LSE:    /* USART1 Clock is LSE Osc. */
            if (LL_RCC_LSE_IsReady() == 1U)
            {
                usart_frequency = LSE_VALUE;
            }
            break;

        case LL_RCC_USART1_CLKSOURCE_PCLK1:  /* USART1 Clock is PCLK1 */
        default:
            usart_frequency = RCC_GetPCLK1ClockFreq(RCC_GetHCLKClockFreq(RCC_GetSystemClockFreq()));
            break;
        }
    }
#if defined(RCC_CCIPR_USART2SEL)
    else if (USARTxSource == LL_RCC_USART2_CLKSOURCE)
    {
        /* USART2CLK clock frequency */
        switch (LL_RCC_GetUSARTClockSource(USARTxSource))
        {
        case LL_RCC_USART2_CLKSOURCE_SYSCLK: /* USART2 Clock is System Clock */
            usart_frequency = RCC_GetSystemClockFreq();
            break;

        case LL_RCC_USART2_CLKSOURCE_HSI:    /* USART2 Clock is HSI Osc. */
            if (LL_RCC_HSI_IsReady() == 1U)
            {
                usart_frequency = HSI_VALUE;
            }
            break;

        case LL_RCC_USART2_CLKSOURCE_LSE:    /* USART2 Clock is LSE Osc. */
            if (LL_RCC_LSE_IsReady() == 1U)
            {
                usart_frequency = LSE_VALUE;
            }
            break;

        case LL_RCC_USART2_CLKSOURCE_PCLK1:  /* USART2 Clock is PCLK1 */
        default:
            usart_frequency = RCC_GetPCLK1ClockFreq(RCC_GetHCLKClockFreq(RCC_GetSystemClockFreq()));
            break;
        }
    }
#endif
    else
    {
    }
    return usart_frequency;
}

/**
  * @brief  Return I2Cx clock frequency
  * @param  I2CxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE
  * @retval I2C clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that HSI oscillator is not ready
  */
uint32_t LL_RCC_GetI2CClockFreq(uint32_t I2CxSource)
{
    uint32_t i2c_frequency = LL_RCC_PERIPH_FREQUENCY_NO;

    /* Check parameter */
    assert_param(IS_LL_RCC_I2C_CLKSOURCE(I2CxSource));

    if (I2CxSource == LL_RCC_I2C1_CLKSOURCE)
    {
        /* I2C1 CLK clock frequency */
        switch (LL_RCC_GetI2CClockSource(I2CxSource))
        {
        case LL_RCC_I2C1_CLKSOURCE_SYSCLK: /* I2C1 Clock is System Clock */
            i2c_frequency = RCC_GetSystemClockFreq();
            break;

        case LL_RCC_I2C1_CLKSOURCE_HSI:    /* I2C1 Clock is HSI Osc. */
            if (LL_RCC_HSI_IsReady() == 1U)
            {
                i2c_frequency = HSI_VALUE;
            }
            break;

        case LL_RCC_I2C1_CLKSOURCE_PCLK1:  /* I2C1 Clock is PCLK1 */
        default:
            i2c_frequency = RCC_GetPCLK1ClockFreq(RCC_GetHCLKClockFreq(RCC_GetSystemClockFreq()));
            break;
        }
    }
    else
    {
    }

    return i2c_frequency;
}

/**
  * @brief  Return I2Sx clock frequency
  * @param  I2SxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_I2S1_CLKSOURCE
  * @retval I2S clock frequency (in Hz)
  *         @arg @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetI2SClockFreq(uint32_t I2SxSource)
{
    uint32_t i2s_frequency = LL_RCC_PERIPH_FREQUENCY_NO;

    /* Check parameter */
    assert_param(IS_LL_RCC_I2S_CLKSOURCE(I2SxSource));

    if (I2SxSource == LL_RCC_I2S1_CLKSOURCE)
    {
        /* I2S1 CLK clock frequency */
        switch (LL_RCC_GetI2SClockSource(I2SxSource))
        {
        case LL_RCC_I2S1_CLKSOURCE_HSI:    /* I2S1 Clock is HSI */
            i2s_frequency = HSI_VALUE;
            break;

        case LL_RCC_I2S1_CLKSOURCE_PLL:    /* I2S1 Clock is PLL"P" */
            if (LL_RCC_PLL_IsReady() == 1U)
            {
                i2s_frequency = RCC_PLL_GetFreqDomain_I2S1();
            }
            break;


        case LL_RCC_I2S1_CLKSOURCE_PIN:          /* I2S1 Clock is External clock */
            i2s_frequency = EXTERNAL_CLOCK_VALUE;
            break;

        case LL_RCC_I2S1_CLKSOURCE_SYSCLK: /* I2S1 Clock is System Clock */
        default:
            i2s_frequency = RCC_GetSystemClockFreq();
            break;
        }
    }

    return i2s_frequency;
}

#if defined(LPUART1)
/**
  * @brief  Return LPUARTx clock frequency
  * @param  LPUARTxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE
  * @retval LPUART clock frequency (in Hz)
  *         @arg @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator (HSI or LSE) is not ready
  */
uint32_t LL_RCC_GetLPUARTClockFreq(uint32_t LPUARTxSource)
{
    uint32_t lpuart_frequency = LL_RCC_PERIPH_FREQUENCY_NO;

    /* Check parameter */
    assert_param(IS_LL_RCC_LPUART_CLKSOURCE(LPUARTxSource));

    /* LPUART1CLK clock frequency */
    switch (LL_RCC_GetLPUARTClockSource(LPUARTxSource))
    {
    case LL_RCC_LPUART1_CLKSOURCE_SYSCLK: /* LPUART1 Clock is System Clock */
        lpuart_frequency = RCC_GetSystemClockFreq();
        break;

    case LL_RCC_LPUART1_CLKSOURCE_HSI:    /* LPUART1 Clock is HSI Osc. */
        if (LL_RCC_HSI_IsReady() == 1U)
        {
            lpuart_frequency = HSI_VALUE;
        }
        break;

