sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_ll_rcc.c
    case LL_RCC_LPUART1_CLKSOURCE_LSE:    /* LPUART1 Clock is LSE Osc. */
        if (LL_RCC_LSE_IsReady() == 1U)
        {
            lpuart_frequency = LSE_VALUE;
        }
        break;

    case LL_RCC_LPUART1_CLKSOURCE_PCLK1:  /* LPUART1 Clock is PCLK1 */
    default:
        lpuart_frequency = RCC_GetPCLK1ClockFreq(RCC_GetHCLKClockFreq(RCC_GetSystemClockFreq()));
        break;
    }

    return lpuart_frequency;
}
#endif /* LPUART1 */

#if defined(LPTIM1) && defined(LPTIM2)
/**
  * @brief  Return LPTIMx clock frequency
  * @param  LPTIMxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE
  * @retval LPTIM clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator (HSI, LSI or LSE) is not ready
  */
uint32_t LL_RCC_GetLPTIMClockFreq(uint32_t LPTIMxSource)
{
    uint32_t lptim_frequency = LL_RCC_PERIPH_FREQUENCY_NO;

    /* Check parameter */
    assert_param(IS_LL_RCC_LPTIM_CLKSOURCE(LPTIMxSource));

    if (LPTIMxSource == LL_RCC_LPTIM1_CLKSOURCE)
    {
        /* LPTIM1CLK clock frequency */
        switch (LL_RCC_GetLPTIMClockSource(LPTIMxSource))
        {
        case LL_RCC_LPTIM1_CLKSOURCE_LSI:    /* LPTIM1 Clock is LSI Osc. */
            if (LL_RCC_LSI_IsReady() == 1U)
            {
                lptim_frequency = LSI_VALUE;
            }
            break;

        case LL_RCC_LPTIM1_CLKSOURCE_HSI:    /* LPTIM1 Clock is HSI Osc. */
            if (LL_RCC_HSI_IsReady() == 1U)
            {
                lptim_frequency = HSI_VALUE;
            }
            break;

        case LL_RCC_LPTIM1_CLKSOURCE_LSE:    /* LPTIM1 Clock is LSE Osc. */
            if (LL_RCC_LSE_IsReady() == 1U)
            {
                lptim_frequency = LSE_VALUE;
            }
            break;

        case LL_RCC_LPTIM1_CLKSOURCE_PCLK1:  /* LPTIM1 Clock is PCLK1 */
        default:
            lptim_frequency = RCC_GetPCLK1ClockFreq(RCC_GetHCLKClockFreq(RCC_GetSystemClockFreq()));
            break;
        }
    }
    else
    {
        /* LPTIM2CLK clock frequency */
        switch (LL_RCC_GetLPTIMClockSource(LPTIMxSource))
        {
        case LL_RCC_LPTIM2_CLKSOURCE_LSI:    /* LPTIM2 Clock is LSI Osc. */
            if (LL_RCC_LSI_IsReady() == 1U)
            {
                lptim_frequency = LSI_VALUE;
            }
            break;

        case LL_RCC_LPTIM2_CLKSOURCE_HSI:    /* LPTIM2 Clock is HSI Osc. */
            if (LL_RCC_HSI_IsReady() == 1U)
            {
                lptim_frequency = HSI_VALUE;
            }
            break;

        case LL_RCC_LPTIM2_CLKSOURCE_LSE:    /* LPTIM2 Clock is LSE Osc. */
            if (LL_RCC_LSE_IsReady() == 1U)
            {
                lptim_frequency = LSE_VALUE;
            }
            break;

        case LL_RCC_LPTIM2_CLKSOURCE_PCLK1:  /* LPTIM2 Clock is PCLK1 */
        default:
            lptim_frequency = RCC_GetPCLK1ClockFreq(RCC_GetHCLKClockFreq(RCC_GetSystemClockFreq()));
            break;
        }
    }

    return lptim_frequency;
}
#endif /* LPTIM1 && LPTIM2 */

#if defined(RCC_CCIPR_TIM1SEL) || defined(RCC_CCIPR_TIM15SEL)
/**
  * @brief  Return TIMx clock frequency
  * @param  TIMxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_TIM1_CLKSOURCE
  * @retval TIMx clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator (HSI or LSE) is not ready
  */
uint32_t LL_RCC_GetTIMClockFreq(uint32_t TIMxSource)
{
    uint32_t tim_frequency = LL_RCC_PERIPH_FREQUENCY_NO;

    /* Check parameter */
    assert_param(IS_LL_RCC_TIM_CLKSOURCE(TIMxSource));

    if (TIMxSource == LL_RCC_TIM1_CLKSOURCE)
    {
        /* TIM1CLK clock frequency */
        switch (LL_RCC_GetTIMClockSource(TIMxSource))
        {
        case LL_RCC_TIM1_CLKSOURCE_PLL:    /* TIM1 Clock is PLLQ */
            if (LL_RCC_PLL_IsReady() == 1U)
            {
                tim_frequency = RCC_PLL_GetFreqDomain_TIM1();
            }
            break;

        case LL_RCC_TIM1_CLKSOURCE_PCLK1:  /* TIM1 Clock is PCLK1 */
        default:
            tim_frequency = RCC_GetPCLK1ClockFreq(RCC_GetHCLKClockFreq(RCC_GetSystemClockFreq()));
            break;
        }
    }
#if defined(TIM15)
    else
    {
        if (TIMxSource == LL_RCC_TIM15_CLKSOURCE)
        {
            /* TIM15CLK clock frequency */
            switch (LL_RCC_GetTIMClockSource(TIMxSource))
            {
            case LL_RCC_TIM15_CLKSOURCE_PLL:    /* TIM1 Clock is PLLQ */
                if (LL_RCC_PLL_IsReady() == 1U)
                {
                    tim_frequency = RCC_PLL_GetFreqDomain_TIM15();
                }
                break;

            case LL_RCC_TIM15_CLKSOURCE_PCLK1:  /* TIM15 Clock is PCLK1 */
            default:
                tim_frequency = RCC_GetPCLK1ClockFreq(RCC_GetHCLKClockFreq(RCC_GetSystemClockFreq()));
                break;
            }
        }
    }
#endif
    return tim_frequency;
}
#endif /* RCC_CCIPR_TIM1SEL && RCC_CCIPR_TIM15SEL */


#if defined(RNG)
/**
  * @brief  Return RNGx clock frequency
  * @param  RNGxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_RNG_CLKSOURCE
  * @retval RNG clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator (HSI) or PLL is not ready
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NA indicates that no clock source selected
  */
uint32_t LL_RCC_GetRNGClockFreq(uint32_t RNGxSource)
{
    uint32_t rng_frequency = LL_RCC_PERIPH_FREQUENCY_NO;
    uint32_t rngdiv;

    /* Check parameter */
    assert_param(IS_LL_RCC_RNG_CLKSOURCE(RNGxSource));

    /* RNGCLK clock frequency */
    switch (LL_RCC_GetRNGClockSource(RNGxSource))
    {
    case LL_RCC_RNG_CLKSOURCE_PLL:           /* PLL clock used as RNG clock source */
        if (LL_RCC_PLL_IsReady() == 1U)
        {
            rng_frequency = RCC_PLL_GetFreqDomain_RNG();
            rngdiv = (1UL << ((READ_BIT(RCC->CCIPR, RCC_CCIPR_RNGDIV)) >> RCC_CCIPR_RNGDIV_Pos));
            rng_frequency = (rng_frequency / rngdiv);
        }
        break;

    case LL_RCC_RNG_CLKSOURCE_HSI_DIV8:      /* HSI clock divided by 8 used as RNG clock source */
        rng_frequency = HSI_VALUE / 8U;
        rngdiv = (1UL << ((READ_BIT(RCC->CCIPR, RCC_CCIPR_RNGDIV)) >> RCC_CCIPR_RNGDIV_Pos));
        rng_frequency = (rng_frequency / rngdiv);
        break;
    case LL_RCC_RNG_CLKSOURCE_SYSCLK:        /* SYSCLK clock used as RNG clock source */
        rng_frequency = RCC_GetSystemClockFreq();
        rngdiv = (1UL << ((READ_BIT(RCC->CCIPR, RCC_CCIPR_RNGDIV)) >> RCC_CCIPR_RNGDIV_Pos));
        rng_frequency = (rng_frequency / rngdiv);
        break;

