sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_ll_rcc.c
    case LL_RCC_RNG_CLKSOURCE_NONE:          /* No clock used as RNG clock source */
    default:
        rng_frequency = LL_RCC_PERIPH_FREQUENCY_NA;
        break;

    }

    return rng_frequency;
}
#endif /* RNG */

#if defined(CEC)
/**
  * @brief  Return CEC clock frequency
  * @param  CECxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_CEC_CLKSOURCE
  * @retval CEC clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator (HSI or LSE) is not ready
  */
uint32_t LL_RCC_GetCECClockFreq(uint32_t CECxSource)
{
    uint32_t cec_frequency = LL_RCC_PERIPH_FREQUENCY_NO;

    /* Check parameter */
    assert_param(IS_LL_RCC_CEC_CLKSOURCE(CECxSource));

    /* CECCLK clock frequency */
    switch (LL_RCC_GetCECClockSource(CECxSource))
    {
    case LL_RCC_CEC_CLKSOURCE_LSE:           /* CEC Clock is LSE Osc. */
        if (LL_RCC_LSE_IsReady() == 1U)
        {
            cec_frequency = LSE_VALUE;
        }
        break;

    case LL_RCC_CEC_CLKSOURCE_HSI_DIV488:    /* CEC Clock is HSI Osc. */
    default:
        if (LL_RCC_HSI_IsReady() == 1U)
        {
            cec_frequency = (HSI_VALUE / 488U);
        }
        break;
    }

    return cec_frequency;
}
#endif /* CEC */

/**
  * @brief  Return ADCx clock frequency
  * @param  ADCxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ADC_CLKSOURCE
  * @retval ADC clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator (HSI) or PLL is not ready
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NA indicates that no clock source selected
  */
uint32_t LL_RCC_GetADCClockFreq(uint32_t ADCxSource)
{
    uint32_t adc_frequency = LL_RCC_PERIPH_FREQUENCY_NO;

    /* Check parameter */
    assert_param(IS_LL_RCC_ADC_CLKSOURCE(ADCxSource));

    /* ADCCLK clock frequency */
    switch (LL_RCC_GetADCClockSource(ADCxSource))
    {
    case LL_RCC_ADC_CLKSOURCE_SYSCLK:        /* SYSCLK clock used as ADC clock source */
        adc_frequency = RCC_GetSystemClockFreq();
        break;
    case LL_RCC_ADC_CLKSOURCE_HSI  :        /* HSI clock used as ADC clock source */
        adc_frequency = HSI_VALUE;
        break;

    case LL_RCC_ADC_CLKSOURCE_PLL:         /* PLLP clock used as ADC clock source */
        if (LL_RCC_PLL_IsReady() == 1U)
        {
            adc_frequency = RCC_PLL_GetFreqDomain_ADC();
        }
        break;
    default:
        adc_frequency = LL_RCC_PERIPH_FREQUENCY_NA;
        break;
    }

    return adc_frequency;
}

/**
  * @brief  Return RTC clock frequency
  * @retval RTC clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillators (LSI, LSE or HSE) are not ready
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NA indicates that no clock source selected
  */
uint32_t LL_RCC_GetRTCClockFreq(void)
{
    uint32_t rtc_frequency = LL_RCC_PERIPH_FREQUENCY_NO;

    /* RTCCLK clock frequency */
    switch (LL_RCC_GetRTCClockSource())
    {
    case LL_RCC_RTC_CLKSOURCE_LSE:       /* LSE clock used as RTC clock source */
        if (LL_RCC_LSE_IsReady() == 1U)
        {
            rtc_frequency = LSE_VALUE;
        }
        break;

    case LL_RCC_RTC_CLKSOURCE_LSI:       /* LSI clock used as RTC clock source */
        if (LL_RCC_LSI_IsReady() == 1U)
        {
            rtc_frequency = LSI_VALUE;
        }
        break;

    case LL_RCC_RTC_CLKSOURCE_HSE_DIV32:        /* HSE clock used as ADC clock source */
        rtc_frequency = HSE_VALUE / 32U;
        break;

    case LL_RCC_RTC_CLKSOURCE_NONE:          /* No clock used as RTC clock source */
    default:
        rtc_frequency = LL_RCC_PERIPH_FREQUENCY_NA;
        break;
    }

    return rtc_frequency;
}

/**
  * @}
  */

/**
  * @}
  */

/** @addtogroup RCC_LL_Private_Functions
  * @{
  */

/**
  * @brief  Return SYSTEM clock frequency
  * @retval SYSTEM clock frequency (in Hz)
  */
uint32_t RCC_GetSystemClockFreq(void)
{
    uint32_t frequency;
    uint32_t hsidiv;

    /* Get SYSCLK source -------------------------------------------------------*/
    switch (LL_RCC_GetSysClkSource())
    {
    case LL_RCC_SYS_CLKSOURCE_STATUS_HSE:  /* HSE used as system clock  source */
        frequency = HSE_VALUE;
        break;

    case LL_RCC_SYS_CLKSOURCE_STATUS_PLL:  /* PLL used as system clock  source */
        frequency = RCC_PLL_GetFreqDomain_SYS();
        break;

    case LL_RCC_SYS_CLKSOURCE_STATUS_HSI:  /* HSI used as system clock  source */
    default:
        hsidiv = (1UL << ((READ_BIT(RCC->CR, RCC_CR_HSIDIV)) >> RCC_CR_HSIDIV_Pos));
        frequency = (HSI_VALUE / hsidiv);
        break;
    }

    return frequency;
}

/**
  * @brief  Return HCLK clock frequency
  * @param  SYSCLK_Frequency SYSCLK clock frequency
  * @retval HCLK clock frequency (in Hz)
  */
uint32_t RCC_GetHCLKClockFreq(uint32_t SYSCLK_Frequency)
{
    /* HCLK clock frequency */
    return __LL_RCC_CALC_HCLK_FREQ(SYSCLK_Frequency, LL_RCC_GetAHBPrescaler());
}

/**
  * @brief  Return PCLK1 clock frequency
  * @param  HCLK_Frequency HCLK clock frequency
  * @retval PCLK1 clock frequency (in Hz)
  */
uint32_t RCC_GetPCLK1ClockFreq(uint32_t HCLK_Frequency)
{
    /* PCLK1 clock frequency */
    return __LL_RCC_CALC_PCLK1_FREQ(HCLK_Frequency, LL_RCC_GetAPB1Prescaler());
}
/**
  * @brief  Return PLL clock frequency used for system domain
  * @retval PLL clock frequency (in Hz)
  */
uint32_t RCC_PLL_GetFreqDomain_SYS(void)
{
    uint32_t pllinputfreq, pllsource;

    /* PLL_VCO = (HSE_VALUE or HSI_VALUE / PLLM) * PLLN
       SYSCLK = PLL_VCO / PLLR
    */
    pllsource = LL_RCC_PLL_GetMainSource();

    switch (pllsource)
    {
    case LL_RCC_PLLSOURCE_HSI:  /* HSI used as PLL clock source */
        pllinputfreq = HSI_VALUE;
        break;

    case LL_RCC_PLLSOURCE_HSE:  /* HSE used as PLL clock source */
        pllinputfreq = HSE_VALUE;
        break;

    default:
        pllinputfreq = HSI_VALUE;
        break;
    }
    return __LL_RCC_CALC_PLLCLK_FREQ(pllinputfreq, LL_RCC_PLL_GetDivider(),
                                     LL_RCC_PLL_GetN(), LL_RCC_PLL_GetR());
}
/**
  * @brief  Return PLL clock frequency used for ADC domain
  * @retval PLL clock frequency (in Hz)
  */
uint32_t RCC_PLL_GetFreqDomain_ADC(void)
{
    uint32_t pllinputfreq, pllsource;

    /* PLL_VCO = (HSE_VALUE or HSI_VALUE / PLLM) * PLLN
       ADC Domain clock = PLL_VCO / PLLP
    */
    pllsource = LL_RCC_PLL_GetMainSource();

