sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_ll_rcc.c
    switch (pllsource)
    {
    case LL_RCC_PLLSOURCE_HSE:  /* HSE used as PLL clock source */
        pllinputfreq = HSE_VALUE;
        break;

    case LL_RCC_PLLSOURCE_HSI:  /* HSI used as PLL clock source */
    default:
        pllinputfreq = HSI_VALUE;
        break;
    }
    return __LL_RCC_CALC_PLLCLK_ADC_FREQ(pllinputfreq, LL_RCC_PLL_GetDivider(),
                                         LL_RCC_PLL_GetN(), LL_RCC_PLL_GetP());
}

/**
  * @brief  Return PLL clock frequency used for I2S1 domain
  * @retval PLL clock frequency (in Hz)
  */
uint32_t RCC_PLL_GetFreqDomain_I2S1(void)
{
    uint32_t pllinputfreq, pllsource;

    /* PLL_VCO = (HSE_VALUE or HSI_VALUE / PLLM) * PLLN
       I2S1 Domain clock = PLL_VCO / PLLP
    */
    pllsource = LL_RCC_PLL_GetMainSource();

    switch (pllsource)
    {
    case LL_RCC_PLLSOURCE_HSE:  /* HSE used as PLL clock source */
        pllinputfreq = HSE_VALUE;
        break;

    case LL_RCC_PLLSOURCE_HSI:  /* HSI used as PLL clock source */
    default:
        pllinputfreq = HSI_VALUE;
        break;
    }
    return __LL_RCC_CALC_PLLCLK_I2S1_FREQ(pllinputfreq, LL_RCC_PLL_GetDivider(),
                                          LL_RCC_PLL_GetN(), LL_RCC_PLL_GetP());
}

#if defined(RNG)
/**
  * @brief  Return PLL clock frequency used for RNG domain
  * @retval PLL clock frequency (in Hz)
  */
uint32_t RCC_PLL_GetFreqDomain_RNG(void)
{
    uint32_t pllinputfreq, pllsource;

    /* PLL_VCO = (HSE_VALUE or HSI_VALUE / PLLM ) * PLLN

       RNG Domain clock = PLL_VCO / PLLQ
    */
    pllsource = LL_RCC_PLL_GetMainSource();

    switch (pllsource)
    {
    case LL_RCC_PLLSOURCE_HSE:  /* HSE used as PLL clock source */
        pllinputfreq = HSE_VALUE;
        break;

    case LL_RCC_PLLSOURCE_HSI:  /* HSI used as PLL clock source */
    default:
        pllinputfreq = HSI_VALUE;
        break;
    }
    return __LL_RCC_CALC_PLLCLK_RNG_FREQ(pllinputfreq, LL_RCC_PLL_GetDivider(),
                                         LL_RCC_PLL_GetN(), LL_RCC_PLL_GetQ());
}
#endif /* RNG */

#if defined(RCC_PLLQ_SUPPORT)
/**
  * @brief  Return PLL clock frequency used for TIM1 domain
  * @retval PLL clock frequency (in Hz)
  */
uint32_t RCC_PLL_GetFreqDomain_TIM1(void)
{
    uint32_t pllinputfreq, pllsource;

    /* PLL_VCO = (HSE_VALUE or HSI_VALUE / PLLM ) * PLLN

       TIM1 Domain clock = PLL_VCO / PLLQ
    */
    pllsource = LL_RCC_PLL_GetMainSource();

    switch (pllsource)
    {
    case LL_RCC_PLLSOURCE_HSE:  /* HSE used as PLL clock source */
        pllinputfreq = HSE_VALUE;
        break;

    case LL_RCC_PLLSOURCE_HSI:  /* HSI used as PLL clock source */
    default:
        pllinputfreq = HSI_VALUE;
        break;
    }
    return __LL_RCC_CALC_PLLCLK_TIM1_FREQ(pllinputfreq, LL_RCC_PLL_GetDivider(),
                                          LL_RCC_PLL_GetN(), LL_RCC_PLL_GetQ());
}
#endif /* RCC_PLLQ_SUPPORT */

#if defined(RCC_PLLQ_SUPPORT) && defined(TIM15)
/**
  * @brief  Return PLL clock frequency used for TIM15 domain
  * @retval PLL clock frequency (in Hz)
  */
uint32_t RCC_PLL_GetFreqDomain_TIM15(void)
{
    uint32_t pllinputfreq, pllsource;

    /* PLL_VCO = (HSE_VALUE or HSI_VALUE / PLLM ) * PLLN

       TIM15 Domain clock = PLL_VCO / PLLQ
    */
    pllsource = LL_RCC_PLL_GetMainSource();

    switch (pllsource)
    {
    case LL_RCC_PLLSOURCE_HSE:  /* HSE used as PLL clock source */
        pllinputfreq = HSE_VALUE;
        break;

    case LL_RCC_PLLSOURCE_HSI:  /* HSI used as PLL clock source */
    default:
        pllinputfreq = HSI_VALUE;
        break;
    }
    return __LL_RCC_CALC_PLLCLK_TIM15_FREQ(pllinputfreq, LL_RCC_PLL_GetDivider(),
                                           LL_RCC_PLL_GetN(), LL_RCC_PLL_GetQ());
}
#endif /* RCC_PLLQ_SUPPORT && TIM15 */
/**
  * @}
  */

/**
  * @}
  */

#endif /* defined(RCC) */

/**
  * @}
  */

#endif /* USE_FULL_LL_DRIVER */

/************************ (C) COPYRIGHT Puya*****END OF FILE****/
